src/InformationRegisters/ЖурналРегистрацииТриггерныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииТриггерныхСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SMSРассылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРегистрацииСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Сообщение о коллизии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияПоПодписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыРегистрацииСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыРегистрацииСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
					<Comment>Отклонено системой фильтрации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРегистрации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыДействийТриггерныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыДействийТриггерныхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаМенеджеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеPUSH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовыситьЭтапСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СменитьЭтапСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеВМесенджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктивироватьЧатБота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЖурналРегистрацииТриггерныхСобытий/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура - Зарегистрировать событие триггера
//
// Параметры:
//  ДанныеТриггера								 - 	 - 
//  ДатаВремяНачалаРаботы						 - 	 - 
//  ДатаВремяОкончанияРаботы					 - 	 - 
//  УникальныйИдентификаторРегистрацииСобытия	 - 	 - 
//
Процедура ЗарегистрироватьСобытиеТриггера(ПараметрыРегистрацииТриггера) Экспорт 
	                        
	// Создаем менеджер записи
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	// Инициируем явную блокировку по ключевым измерениям
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЖурналРегистрацииТриггерныхСобытий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТриггерноеСобытие"	, ПараметрыРегистрацииТриггера.ТриггерноеСобытие);
	Если ЗначениеЗаполнено(ПараметрыРегистрацииТриггера.Контрагент) Тогда 	
		ЭлементБлокировки.УстановитьЗначение("Контрагент"		, ПараметрыРегистрацииТриггера.Контрагент);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПараметрыРегистрацииТриггера.ОбъектСобытия) Тогда 
		ЭлементБлокировки.УстановитьЗначение("ОбъектСобытия"	, ПараметрыРегистрацииТриггера.ОбъектСобытия);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыРегистрацииТриггера.ИсточникСобытия) Тогда 
		ЭлементБлокировки.УстановитьЗначение("ИсточникСобытия"	, ПараметрыРегистрацииТриггера.ИсточникСобытия);
	КонецЕсли;		
	ЭлементБлокировки.УстановитьЗначение("РегистрацияПоПодписке", ПараметрыРегистрацииТриггера.РегистрацияПоПодписке);
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторДействия", ПараметрыРегистрацииТриггера.ИдентификаторДействия);
	
	// Блокируем	
	БлокировкаДанных.Заблокировать();
	
	// Начинаем работу с записью
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыРегистрацииТриггера);
	МенеджерЗаписи.Прочитать();
	// Сохраняем текущий статус
	Статус = МенеджерЗаписи.Статус;
	// Заполняем основные измерения, если запись не была прочитана
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыРегистрацииТриггера);
	
	// Заполняем объект генерации
	Если ЗначениеЗаполнено(ПараметрыРегистрацииТриггера.ОбъектГенерации) Тогда 
		Если ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("ЗадачаСсылка.Взаимодействие") Тогда 
			МенеджерЗаписи.Взаимодействие 				= ПараметрыРегистрацииТриггера.ОбъектГенерации;
		КонецЕсли;	
		Если ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("ДокументСсылка.РассылкаСообщений") Тогда 
			МенеджерЗаписи.SMSРассылка 					= ПараметрыРегистрацииТриггера.ОбъектГенерации;
		КонецЕсли;
		Если ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда 
			МенеджерЗаписи.ЭлектронноеПисьмоИсходящее 	= ПараметрыРегистрацииТриггера.ОбъектГенерации;
		КонецЕсли;
		Если ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("СправочникСсылка.Сделки") Тогда 
			МенеджерЗаписи.Сделка 						= ПараметрыРегистрацииТриггера.ОбъектГенерации;
		КонецЕсли;	
		Если ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("Строка") ИЛИ ТипЗнч(ПараметрыРегистрацииТриггера.ОбъектГенерации) = Тип("УникальныйИдентификатор") Тогда 
			МенеджерЗаписи.IDСообщения 					= ПараметрыРегистрацииТриггера.ОбъектГенерации;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерЗаписи.Описание 							= ПараметрыРегистрацииТриггера.Описание;
	МенеджерЗаписи.Сообщение 							= ПараметрыРегистрацииТриггера.Сообщение;
	
	Если Статус = Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации Тогда 
		МенеджерЗаписи.Статус 							= Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации;	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры	

// Функция - Действие зарегистрировано
// 
// Возвращаемое значение:
//   - 
//
Функция ДействиеЗарегистрировано(ИдентификаторДействия, ВидДействия = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Взаимодействие КАК Взаимодействие,
	               |	ЖурналРегистрацииТриггерныхСобытий.SMSРассылка КАК SMSРассылка,
	               |	ЖурналРегистрацииТриггерныхСобытий.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее,
	               |	ЖурналРегистрацииТриггерныхСобытий.Сделка КАК Сделка
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия = &ИдентификаторДействия";
	
	Запрос.УстановитьПараметр("ИдентификаторДействия", ИдентификаторДействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ФлагВозврата = НЕ РезультатЗапроса.Пустой();
	
	Если ФлагВозврата = Истина Тогда
		ВыборкаСтрокиРегистрации = РезультатЗапроса.Выбрать();
		Если ВыборкаСтрокиРегистрации.Следующий() Тогда 
			Если ЗначениеЗаполнено(ВыборкаСтрокиРегистрации.Взаимодействие) Тогда 
				ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрокиРегистрации.SMSРассылка) Тогда	
				ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрокиРегистрации.ЭлектронноеПисьмоИсходящее) Тогда	
				ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрокиРегистрации.Сделка) Тогда	
				ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ФлагВозврата;
	
КонецФункции

// Процедура - Актуализировать записи в журнале регистрации
//
// Параметры:
//  ТриггерноеСобытие	 - 	 - 
//
Процедура АктуализироватьЗаписиВЖурналеРегистрации(ТриггерноеСобытие) Экспорт
	
	Если ТипЗнч(ТриггерноеСобытие) = Тип("СправочникСсылка.ТриггерныеСобытия") Тогда 
		ТриггерноеСобытиеСсылка = ТриггерноеСобытие;
	ИначеЕсли ТипЗнч(ТриггерноеСобытие) = Тип("СправочникОбъект.ТриггерныеСобытия") Тогда	
		ТриггерноеСобытиеСсылка = ТриггерноеСобытие.Ссылка;
	Иначе 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТриггерныеСобытияДействия.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТриггерныеСобытияДействия.Использование КАК Использование,
	               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия,
	               |	ТриггерныеСобытияДействия.Описание КАК Описание
	               |ПОМЕСТИТЬ ТаблицаПланДействийТриггера
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
	               |ГДЕ
	               |	ТриггерныеСобытияДействия.Ссылка = &ТриггерноеСобытие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.Взаимодействие КАК Взаимодействие,
	               |	ЖурналРегистрацииТриггерныхСобытий.SMSРассылка КАК SMSРассылка,
	               |	ЖурналРегистрацииТриггерныхСобытий.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее,
	               |	ЖурналРегистрацииТриггерныхСобытий.Сделка КАК Сделка,
	               |	ЖурналРегистрацииТриггерныхСобытий.IDСообщения КАК IDСообщения,
	               |	ЖурналРегистрацииТриггерныхСобытий.Статус КАК Статус,
	               |	ЖурналРегистрацииТриггерныхСобытий.Описание КАК Описание,
	               |	ЖурналРегистрацииТриггерныхСобытий.Сообщение КАК Сообщение
	               |ПОМЕСТИТЬ ТаблицаСобытийТриггера
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
	               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСобытийТриггера.Период КАК Период,
	               |	ТаблицаСобытийТриггера.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаСобытийТриггера.Контрагент КАК Контрагент,
	               |	ТаблицаСобытийТриггера.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаСобытийТриггера.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
	               |	ТаблицаПланДействийТриггера.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаСобытийТриггера.Взаимодействие КАК Взаимодействие,
	               |	ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка) КАК SMSРассылка,
	               |	ЗНАЧЕНИЕ(Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка) КАК ЭлектронноеПисьмоИсходящее,
	               |	ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка) КАК Сделка,
	               |	&ПустойIDСообщения КАК IDСообщения,
	               |	ТаблицаСобытийТриггера.Статус КАК Статус,
	               |	ТаблицаПланДействийТриггера.Описание КАК Описание,
	               |	ТаблицаСобытийТриггера.Сообщение КАК Сообщение
	               |ПОМЕСТИТЬ ИтоговаяТаблица
	               |ИЗ
	               |	ТаблицаСобытийТриггера КАК ТаблицаСобытийТриггера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПланДействийТриггера КАК ТаблицаПланДействийТриггера
	               |		ПО (ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру))
	               |ГДЕ
	               |	ТаблицаСобытийТриггера.Взаимодействие <> ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаСобытийТриггера.Период,
	               |	ТаблицаСобытийТриггера.ТриггерноеСобытие,
	               |	ТаблицаСобытийТриггера.Контрагент,
	               |	ТаблицаСобытийТриггера.ОбъектСобытия,
	               |	ТаблицаСобытийТриггера.РегистрацияПоПодписке,
	               |	ТаблицаПланДействийТриггера.ИдентификаторДействия,
	               |	ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка),
	               |	ТаблицаСобытийТриггера.SMSРассылка,
	               |	ЗНАЧЕНИЕ(Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка),
	               |	&ПустойIDСообщения,
	               |	ТаблицаСобытийТриггера.Статус,
	               |	ТаблицаПланДействийТриггера.Описание,
	               |	ТаблицаСобытийТриггера.Сообщение
	               |ИЗ
	               |	ТаблицаСобытийТриггера КАК ТаблицаСобытийТриггера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПланДействийТриггера КАК ТаблицаПланДействийТриггера
	               |		ПО (ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.СообщениеSMS))
	               |ГДЕ
	               |	ТаблицаСобытийТриггера.SMSРассылка <> ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаСобытийТриггера.Период,
	               |	ТаблицаСобытийТриггера.ТриггерноеСобытие,
	               |	ТаблицаСобытийТриггера.Контрагент,
	               |	ТаблицаСобытийТриггера.ОбъектСобытия,
	               |	ТаблицаСобытийТриггера.РегистрацияПоПодписке,
	               |	ТаблицаПланДействийТриггера.ИдентификаторДействия,
	               |	ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка),
	               |	ТаблицаСобытийТриггера.IDСообщения,
	               |	ТаблицаСобытийТриггера.Статус,
	               |	ТаблицаПланДействийТриггера.Описание,
	               |	ТаблицаСобытийТриггера.Сообщение
	               |ИЗ
	               |	ТаблицаСобытийТриггера КАК ТаблицаСобытийТриггера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПланДействийТриггера КАК ТаблицаПланДействийТриггера
	               |		ПО (ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.СообщениеВМесенджер))
	               |ГДЕ
	               |	ТаблицаСобытийТриггера.IDСообщения <> &ПустойIDСообщения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаСобытийТриггера.Период,
	               |	ТаблицаСобытийТриггера.ТриггерноеСобытие,
	               |	ТаблицаСобытийТриггера.Контрагент,
	               |	ТаблицаСобытийТриггера.ОбъектСобытия,
	               |	ТаблицаСобытийТриггера.РегистрацияПоПодписке,
	               |	ТаблицаПланДействийТриггера.ИдентификаторДействия,
	               |	ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка),
	               |	ТаблицаСобытийТриггера.ЭлектронноеПисьмоИсходящее,
	               |	ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка),
	               |	&ПустойIDСообщения,
	               |	ТаблицаСобытийТриггера.Статус,
	               |	ТаблицаПланДействийТриггера.Описание,
	               |	ТаблицаСобытийТриггера.Сообщение
	               |ИЗ
	               |	ТаблицаСобытийТриггера КАК ТаблицаСобытийТриггера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПланДействийТриггера КАК ТаблицаПланДействийТриггера
	               |		ПО (ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо))
	               |ГДЕ
	               |	ТаблицаСобытийТриггера.ЭлектронноеПисьмоИсходящее <> ЗНАЧЕНИЕ(Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаСобытийТриггера.Период,
	               |	ТаблицаСобытийТриггера.ТриггерноеСобытие,
	               |	ТаблицаСобытийТриггера.Контрагент,
	               |	ТаблицаСобытийТриггера.ОбъектСобытия,
	               |	ТаблицаСобытийТриггера.РегистрацияПоПодписке,
	               |	ТаблицаПланДействийТриггера.ИдентификаторДействия,
	               |	ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.РассылкаСообщений.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.ЭлектронноеПисьмоИсходящее.ПустаяСсылка),
	               |	ТаблицаСобытийТриггера.Сделка,
	               |	&ПустойIDСообщения,
	               |	ТаблицаСобытийТриггера.Статус,
	               |	ТаблицаПланДействийТриггера.Описание,
	               |	ТаблицаСобытийТриггера.Сообщение
	               |ИЗ
	               |	ТаблицаСобытийТриггера КАК ТаблицаСобытийТриггера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПланДействийТриггера КАК ТаблицаПланДействийТриггера
	               |		ПО (ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки)
	               |				ИЛИ ТаблицаПланДействийТриггера.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки))
	               |ГДЕ
	               |	ТаблицаСобытийТриггера.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.Период КАК Период,
	               |	ИтоговаяТаблица.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ИтоговаяТаблица.Контрагент КАК Контрагент,
	               |	ИтоговаяТаблица.ОбъектСобытия КАК ОбъектСобытия,
	               |	ИтоговаяТаблица.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
	               |	ИтоговаяТаблица.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ИтоговаяТаблица.Взаимодействие КАК Взаимодействие,
	               |	ИтоговаяТаблица.SMSРассылка КАК SMSРассылка,
	               |	ИтоговаяТаблица.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее,
	               |	ИтоговаяТаблица.Сделка КАК Сделка,
	               |	ИтоговаяТаблица.IDСообщения КАК IDСообщения,
	               |	ИтоговаяТаблица.Статус КАК Статус,
	               |	ИтоговаяТаблица.Описание КАК Описание,
	               |	ВЫРАЗИТЬ(ИтоговаяТаблица.Сообщение КАК СТРОКА(1024)) КАК Сообщение
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИтоговаяТаблица.SMSРассылка,
	               |	ИтоговаяТаблица.ЭлектронноеПисьмоИсходящее,
	               |	ИтоговаяТаблица.Период,
	               |	ИтоговаяТаблица.IDСообщения,
	               |	ИтоговаяТаблица.РегистрацияПоПодписке,
	               |	ИтоговаяТаблица.Сделка,
	               |	ИтоговаяТаблица.Контрагент,
	               |	ИтоговаяТаблица.ИдентификаторДействия,
	               |	ИтоговаяТаблица.ТриггерноеСобытие,
	               |	ИтоговаяТаблица.Описание,
	               |	ИтоговаяТаблица.ОбъектСобытия,
	               |	ВЫРАЗИТЬ(ИтоговаяТаблица.Сообщение КАК СТРОКА(1024)),
	               |	ИтоговаяТаблица.Статус,
	               |	ИтоговаяТаблица.Взаимодействие
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("ТриггерноеСобытие", ТриггерноеСобытиеСсылка);
	Запрос.УстановитьПараметр("ПустойIDСообщения", "");
	
	ТаблицаСобытийТриггера = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаСобытийТриггера.Количество() > 0 Тогда 
		НаборЗаписей = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ТриггерноеСобытие.Значение 		= ТриггерноеСобытиеСсылка;
		НаборЗаписей.Отбор.ТриггерноеСобытие.Использование 	= Истина;
		
		//НачатьТранзакцию();
		//БлокировкаДанных = Новый БлокировкаДанных;
		//ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЖурналРегистрацииТриггерныхСобытий");
		//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		//ЭлементБлокировки.УстановитьЗначение("ТриггерноеСобытие", ТриггерноеСобытиеСсылка);
		//БлокировкаДанных.Заблокировать();
		//
		//НаборЗаписей.Прочитать();
		
		НаборЗаписей.Загрузить(ТаблицаСобытийТриггера);
		
		НаборЗаписей.Записать();
		//ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
